/*                                   
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
─██████──────────██████████████──████████████████────████████████────────────────────────────██████──██████████████──██████████████──██████─────────
─██░░██──────────██░░░░░░░░░░██──██░░░░░░░░░░░░██────██░░░░░░░░████──────────────────────────██░░██──██░░░░░░░░░░██──██░░░░░░░░░░██──██░░██─────────
─██░░██──────────██░░██████░░██──██░░████████░░██────██░░████░░░░██──────────────────────────██░░██──██░░██████░░██──██░░██████████──██░░██─────────
─██░░██──────────██░░██──██░░██──██░░██────██░░██────██░░██──██░░██──────────────────────────██░░██──██░░██──██░░██──██░░██──────────██░░██─────────
─██░░██──────────██░░██──██░░██──██░░████████░░██────██░░██──██░░██──██████████████──────────██░░██──██░░██──██░░██──██░░██████████──██░░██─────────
─██░░██──────────██░░██──██░░██──██░░░░░░░░░░░░██────██░░██──██░░██──██░░░░░░░░░░██──────────██░░██──██░░██──██░░██──██░░░░░░░░░░██──██░░██─────────
─██░░██──────────██░░██──██░░██──██░░██████░░████────██░░██──██░░██──██████████████──██████──██░░██──██░░██──██░░██──██░░██████████──██░░██─────────
─██░░██──────────██░░██──██░░██──██░░██──██░░██──────██░░██──██░░██──────────────────██░░██──██░░██──██░░██──██░░██──██░░██──────────██░░██─────────
─██░░██████████──██░░██████░░██──██░░██──██░░██████──██░░████░░░░██──────────────────██░░██████░░██──██░░██████░░██──██░░██████████──██░░██████████─
─██░░░░░░░░░░██──██░░░░░░░░░░██──██░░██──██░░░░░░██──██░░░░░░░░████──────────────────██░░░░░░░░░░██──██░░░░░░░░░░██──██░░░░░░░░░░██──██░░░░░░░░░░██─
─██████████████──██████████████──██████──██████████──████████████────────────────────██████████████──██████████████──██████████████──██████████████─
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
made by Blacktappy 
contact owner +254759000340
*/
const _0x1da6e4 = function () {
  let _0x6f5900 = true;
  return function (_0xbc7518, _0x4752f3) {
    const _0x426c11 = _0x6f5900 ? function () {
      if (_0x4752f3) {
        const _0x2ccb5c = _0x4752f3.apply(_0xbc7518, arguments);
        _0x4752f3 = null;
        return _0x2ccb5c;
      }
    } : function () {};
    _0x6f5900 = false;
    return _0x426c11;
  };
}();
const _0x2964cd = _0x1da6e4(this, function () {
  return _0x2964cd.toString().search("(((.+)+)+)+$").toString().constructor(_0x2964cd).search("(((.+)+)+)+$");
});
_0x2964cd();
const _0x18fb42 = function () {
  const _0x203c9a = {
    VibMh: function (_0x50f4f5, _0x57ba0f) {
      return _0x50f4f5 === _0x57ba0f;
    },
    XYwuU: "HplXN"
  };
  _0x203c9a.nwwIL = "DVqiO";
  _0x203c9a.pjYhL = "DGdbq";
  _0x203c9a.ehFhM = "Failed to fetch the audio response.";
  _0x203c9a.OEQKb = function (_0x74a151, _0x1dc1c0) {
    return _0x74a151 === _0x1dc1c0;
  };
  _0x203c9a.aOOXZ = "ozIRS";
  let _0x148a60 = true;
  return function (_0x59a8c1, _0x2bd8d5) {
    const _0x753d80 = {
      "riVNE": _0x203c9a.ehFhM
    };
    if (_0x203c9a.OEQKb(_0x203c9a.aOOXZ, _0x203c9a.aOOXZ)) {
      const _0x59b0cc = _0x148a60 ? function () {
        if ("HplXN" === _0x203c9a.nwwIL) {
          const _0x566e16 = _0x3b663f.apply(_0x37c40a, arguments);
          _0xb6cbf5 = null;
          return _0x566e16;
        } else {
          if (_0x2bd8d5) {
            if (_0x203c9a.pjYhL === _0x203c9a.pjYhL) {
              const _0x3493ce = _0x2bd8d5.apply(_0x59a8c1, arguments);
              _0x2bd8d5 = null;
              return _0x3493ce;
            } else {
              throw new _0x4ee266(_0x753d80.riVNE);
            }
          }
        }
      } : function () {};
      _0x148a60 = false;
      return _0x59b0cc;
    } else {
      const _0x4b4989 = _0x519527.apply(_0x5963dd, arguments);
      _0x680232 = null;
      return _0x4b4989;
    }
  };
}();
(function () {
  _0x18fb42(this, function () {
    const _0x460cee = new RegExp("function *\\( *\\)");
    const _0xb625f7 = new RegExp("\\+\\+ *(?:[a-zA-Z_$][0-9a-zA-Z_$]*)", 'i');
    const _0x2d7339 = _0x378a53("init");
    if (!_0x460cee.test(_0x2d7339 + "chain") || !_0xb625f7.test(_0x2d7339 + "input")) {
      _0x2d7339('0');
    } else {
      _0x378a53();
    }
  })();
})();
const _0x5ab6a9 = function () {
  const _0x592b27 = {
    FbvBL: "(((.+)+)+)+$"
  };
  _0x592b27.fpVvE = function (_0x4140b8, _0x4da708) {
    return _0x4140b8 === _0x4da708;
  };
  _0x592b27.OOpKs = "VENCA";
  _0x592b27.Iaelj = "SWrvQ";
  _0x592b27.TxMvV = function (_0x5e5d26, _0x45ff3b) {
    return _0x5e5d26 === _0x45ff3b;
  };
  _0x592b27.yEuJG = "qfhUf";
  _0x592b27.JXtDp = function (_0xd321eb, _0x5a21fc) {
    return _0xd321eb !== _0x5a21fc;
  };
  _0x592b27.VRAWh = "kxbzC";
  let _0x367afb = true;
  return function (_0x792f38, _0x1d7d1c) {
    const _0x8c3488 = {
      'bZLWD': "(((.+)+)+)+$",
      'doZsA': function (_0x3ecaed, _0x2cf793) {
        return _0x592b27.fpVvE(_0x3ecaed, _0x2cf793);
      },
      'ZMpGz': _0x592b27.OOpKs,
      'mKwLJ': _0x592b27.Iaelj,
      'JwVOO': function (_0x18d9a4, _0x48bf2b) {
        return _0x592b27.TxMvV(_0x18d9a4, _0x48bf2b);
      },
      'HpaHk': _0x592b27.yEuJG
    };
    if (_0x592b27.JXtDp(_0x592b27.VRAWh, _0x592b27.VRAWh)) {
      const _0x17508f = _0x223f81 ? function () {
        if (_0x5a81f2) {
          const _0x3c9981 = _0x1f13a5.apply(_0x2d91a4, arguments);
          _0x4aa546 = null;
          return _0x3c9981;
        }
      } : function () {};
      _0x352ae2 = false;
      return _0x17508f;
    } else {
      const _0x5299f4 = _0x367afb ? function () {
        if (_0x592b27.fpVvE(_0x8c3488.ZMpGz, _0x8c3488.mKwLJ)) {
          return _0x30cbd4.toString().search("(((.+)+)+)+$").toString().constructor(_0x582ee2).search("(((.+)+)+)+$");
        } else {
          if (_0x1d7d1c) {
            if (_0x592b27.TxMvV(_0x8c3488.HpaHk, _0x8c3488.HpaHk)) {
              const _0x35f886 = _0x1d7d1c.apply(_0x792f38, arguments);
              _0x1d7d1c = null;
              return _0x35f886;
            } else {
              return _0x1b902c;
            }
          }
        }
      } : function () {};
      _0x367afb = false;
      return _0x5299f4;
    }
  };
}();
const _0x4d657c = _0x5ab6a9(this, function () {
  let _0xd0a5c5;
  try {
    const _0x2101bd = Function("return (function() {}.constructor(\"return this\")( ));");
    _0xd0a5c5 = _0x2101bd();
  } catch (_0x215a9e) {
    _0xd0a5c5 = window;
  }
  const _0x4b2161 = _0xd0a5c5.console = _0xd0a5c5.console || {};
  const _0x4f7db1 = ["log", "warn", "info", "error", "exception", "table", "trace"];
  for (let _0x31fc70 = 0; _0x31fc70 < _0x4f7db1.length; _0x31fc70++) {
    const _0x61948d = _0x5ab6a9.constructor.prototype.bind(_0x5ab6a9);
    const _0x4d5c82 = _0x4f7db1[_0x31fc70];
    const _0xf93f68 = _0x4b2161[_0x4d5c82] || _0x61948d;
    _0x61948d.__proto__ = _0x5ab6a9.bind(_0x5ab6a9);
    _0x61948d.toString = _0xf93f68.toString.bind(_0xf93f68);
    _0x4b2161[_0x4d5c82] = _0x61948d;
  }
});
_0x4d657c();
(function () {
  let _0x45d912;
  try {
    const _0x12ba4f = Function("return (function() {}.constructor(\"return this\")( ));");
    _0x45d912 = _0x12ba4f();
  } catch (_0x3d2831) {
    _0x45d912 = window;
  }
  _0x45d912.setInterval(_0x378a53, 4000);
})();
import _0x4859d8 from 'axios';
import _0x5c26cd from '../../config.cjs';
const textToSpeech = async (_0x8d057f, _0x488e5d) => {
  const _0x74662b = _0x5c26cd.PREFIX;
  const _0x356f20 = _0x8d057f.body.startsWith(_0x74662b) ? _0x8d057f.body.slice(_0x74662b.length).split(" ")[0].toLowerCase() : '';
  const _0x467153 = _0x8d057f.body.split(" ").slice(1).join(" ");
  const _0x4b1bfa = ["tts", "say", "speak"];
  if (_0x4b1bfa.includes(_0x356f20)) {
    if (!_0x467153) {
      const _0x5a3a5c = {
        text: " Please provide some text to convert into speech.\n\nExample: *!tts <your text>*"
      };
      await _0x488e5d.sendMessage(_0x8d057f.from, _0x5a3a5c, {
        'quoted': _0x8d057f
      });
      return;
    }
    const _0x3f4432 = "https://bk9.fun/tools/tts-beast?q=" + encodeURIComponent(_0x467153);
    try {
      await _0x8d057f.React('⏳');
      const _0x5d9254 = {
        responseType: "arraybuffer"
      };
      const _0x40940d = await _0x4859d8.get(_0x3f4432, _0x5d9254);
      if (_0x40940d.status === 200) {
        const _0x20e87e = Buffer.from(_0x40940d.data, "binary");
        const _0x1862ba = {
          audio: _0x20e87e,
          mimetype: "audio/mpeg",
          caption: "🔊 *Text-to-Speech Output*\n\n🎙️ Your text has been converted to speech.\n\n*keep using Xeon-xmd bot*"
        };
        await _0x488e5d.sendMessage(_0x8d057f.from, _0x1862ba, {
          'quoted': _0x8d057f
        });
      } else {
        throw new Error("Failed to fetch the audio response.");
      }
    } catch (_0x4b2742) {
      const _0x294891 = {
        text: "Error: " + _0x4b2742.message
      };
      await _0x488e5d.sendMessage(_0x8d057f.from, _0x294891, {
        'quoted': _0x8d057f
      });
    }
  }
};
export default textToSpeech;
function _0x378a53(_0x286453) {
  function _0x3d83a8(_0x3d9666) {
    if (typeof _0x3d9666 === "string") {
      return function (_0x15409e) {}.constructor("while (true) {}").apply("counter");
    } else {
      if (('' + _0x3d9666 / _0x3d9666).length !== 1 || _0x3d9666 % 20 === 0) {
        (function () {
          return true;
        }).constructor("debugger").call("action");
      } else {
        (function () {
          return false;
        }).constructor("debugger").apply("stateObject");
      }
    }
    _0x3d83a8(++_0x3d9666);
  }
  try {
    if (_0x286453) {
      return _0x3d83a8;
    } else {
      _0x3d83a8(0);
    }
  } catch (_0xa0ff93) {}
}